In [1]:
import pandas as pd

In [2]:
url = 'https://www.guidetoonlineschools.com/online-schools?f_show=all'

In [3]:
tables = pd.read_html(url)
tables
upper_df=pd.Series

In [4]:
len(tables)

11

In [5]:
type(tables)

list

In [6]:
df = tables[4]
#df.columns = ['School', 'Annual Tuition', 'Recommend Rate']
df.head()

                         School Annual Tuition    Recommend Rate
0  Abilene Christian University        $33,330  100% (6 reviews)
1    Abraham Lincoln University         $7,500  100% (2 reviews)
2        Adams State University        $20,456   50% (2 reviews)
3            Adelphi University        $37,170        Add Review
4           Alvernia University        $33,640        Add Review

In [7]:
strip_df = df.columns
strip2_df= df[strip_df].replace({' ':''}, regex = True)
strip2_df.head()

                       School Annual Tuition  Recommend Rate
0  AbileneChristianUniversity        $33,330  100%(6reviews)
1    AbrahamLincolnUniversity         $7,500  100%(2reviews)
2        AdamsStateUniversity        $20,456   50%(2reviews)
3           AdelphiUniversity        $37,170       AddReview
4          AlverniaUniversity        $33,640       AddReview

In [8]:
strip2_df["School"]=strip2_df["School"].apply(str.upper)
strip2_df.head()

                       School Annual Tuition  Recommend Rate
0  ABILENECHRISTIANUNIVERSITY        $33,330  100%(6reviews)
1    ABRAHAMLINCOLNUNIVERSITY         $7,500  100%(2reviews)
2        ADAMSSTATEUNIVERSITY        $20,456   50%(2reviews)
3           ADELPHIUNIVERSITY        $37,170       AddReview
4          ALVERNIAUNIVERSITY        $33,640       AddReview

In [9]:
online_schools_df = strip2_df.drop(columns =["Annual Tuition", "Recommend Rate"])
online_schools_df.head()

                       School
0  ABILENECHRISTIANUNIVERSITY
1    ABRAHAMLINCOLNUNIVERSITY
2        ADAMSSTATEUNIVERSITY
3           ADELPHIUNIVERSITY
4          ALVERNIAUNIVERSITY

In [10]:
online_schools_df['School'] =online_schools_df['School'].str.replace("&","")

In [11]:
online_schools_df['School'] =online_schools_df['School'].str.replace("-","")

In [12]:
online_schools_df['Online'] = "TRUE"
online_schools_df.head()

                       School Online
0  ABILENECHRISTIANUNIVERSITY   TRUE
1    ABRAHAMLINCOLNUNIVERSITY   TRUE
2        ADAMSSTATEUNIVERSITY   TRUE
3           ADELPHIUNIVERSITY   TRUE
4          ALVERNIAUNIVERSITY   TRUE

In [13]:
online_schools_df.set_index('School',inplace=True)
online_schools_df.head()

                           Online
School
ABILENECHRISTIANUNIVERSITY   TRUE
ABRAHAMLINCOLNUNIVERSITY     TRUE
ADAMSSTATEUNIVERSITY         TRUE
ADELPHIUNIVERSITY            TRUE
ALVERNIAUNIVERSITY           TRUE

In [14]:
online_schools_df.to_csv('Resources/Online-schools.csv')

In [15]:
print(online_schools_df)

                                               Online
School
ABILENECHRISTIANUNIVERSITY                       TRUE
ABRAHAMLINCOLNUNIVERSITY                         TRUE
ADAMSSTATEUNIVERSITY                             TRUE
ADELPHIUNIVERSITY                                TRUE
ALVERNIAUNIVERSITY                               TRUE
AMERICANINTERCONTINENTALUNIVERSITY               TRUE
AMERICANINTERNATIONALCOLLEGE                     TRUE
AMERICANNATIONALUNIVERSITY                       TRUE
AMERICANPUBLICUNIVERSITYSYSTEM                   TRUE
AMERICANUNIVERSITY                               TRUE
AMERICANUNIVERSITYMBA                            TRUE
ANDERSONUNIVERSITYSC                             TRUE
ANGELOSTATEUNIVERSITY                            TRUE
ANNAMARIACOLLEGE                                 TRUE
ANTIOCHUNIVERSITYONLINE                          TRUE
APPALACHIANSTATEUNIVERSITY                       TRUE
ARCADIAUNIVERSITY                                TRUE
ARIZONASTATEUNIVERSITY                           TRUE
ARKANSASSTATEUNIVERSITY                          TRUE
ASHFORDUNIVERSITY                                TRUE
AUBURNUNIVERSITY                                 TRUE
AUGUSTANAUNIVERSITYSD                            TRUE
AUSTINPEAYSTATEUNIVERSITY                        TRUE
BAKERCOLLEGEONLINE                               TRUE
BALLSTATEUNIVERSITY                              TRUE
THEBAPTISTCOLLEGEOFFLORIDA                       TRUE
BARRYUNIVERSITY                                  TRUE
BAYLORUNIVERSITY                                 TRUE
BELLEVUEUNIVERSITY                               TRUE
BENEDICTINEUNIVERSITY                            TRUE
...                                               ...
VIRGINIAPOLYTECHNICINSTITUTEANDSTATEUNIVERSITY   TRUE
VITERBOUNIVERSITY                                TRUE
WALDENUNIVERSITY                                 TRUE
WALDORFUNIVERSITY                                TRUE
WALSHUNIVERSITY                                  TRUE
WARNERUNIVERSITY                                 TRUE
WASHINGTONSTATEUNIVERSITY                        TRUE
WAYLANDBAPTISTUNIVERSITY                         TRUE
WAYNESTATEUNIVERSITY                             TRUE
WEBSTERUNIVERSITY                                TRUE
WESTCOASTUNIVERSITY                              TRUE
WESTTEXASAMUNIVERSITY                            TRUE
WESTVIRGINIAUNIVERSITY                           TRUE
WESTERNCAROLINAUNIVERSITY                        TRUE
WESTERNGOVERNORSUNIVERSITY                       TRUE
WESTERNILLINOISUNIVERSITY                        TRUE
WESTERNKENTUCKYUNIVERSITY                        TRUE
WESTERNMICHIGANUNIVERSITY                        TRUE
WESTERNNEWENGLANDUNIVERSITY                      TRUE
WESTERNWASHINGTONUNIVERSITY                      TRUE
WHEELINGJESUITUNIVERSITY                         TRUE
WICHITASTATEUNIVERSITY                           TRUE
WIDENERUNIVERSITY                                TRUE
WILKESUNIVERSITY                                 TRUE
WILLIAMCAREYUNIVERSITY                           TRUE
WILLIAMWOODSUNIVERSITY                           TRUE
WINTHROPUNIVERSITY                               TRUE
WRIGHTSTATEUNIVERSITYMAINCAMPUS                  TRUE
YORKCOLLEGE                                      TRUE
YOUNGSTOWNSTATEUNIVERSITY                        TRUE

[567 rows x 1 columns]

In [16]:
online_schools_df.count()

Online    567
dtype: int64